Revit 2026 API

# StructuralCustomConnectionFailures Properties

---

The BuiltInFailuresStructuralCustomConnectionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SimpleConnectionTooFarRefs | Simple Structural Connection Handler cannot connect too far elements |
|  | StructuralCannotCreateCustomConnection | Could not create a custom connection. |
|  | StructuralCustomConnectionComponentsRelationship | Cannot create custom connection due to relationships to external elements. |
|  | StructuralCustomConnectionEmpty | Structural Custom Connection cannot be empty. |
|  | StructuralCustomConnectionWrongType | Structural Custom Connection has an inappropriate type assigned. |

#### Reference

BuiltInFailuresStructuralCustomConnectionFailures Class

Autodesk.Revit.DB Namespace